In [2]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')[['age', 'sex', 'class', 'fare', 'survived']]
df.head()

    age     sex  class     fare  survived
0  22.0    male  Third   7.2500         0
1  38.0  female  First  71.2833         1
2  26.0  female  Third   7.9250         1
3  35.0  female  First  53.1000         1
4  35.0    male  Third   8.0500         0

### 피벗 테이블 함수: pivot_table()
- 행 인덱스
- 열 인덱스
- 데이터 값
- 데이터 집계함수

In [3]:
# 행에는 class열의 3가지 그룹, 열에는 sex열의 2가지 그룹, 값에는 age열을 평균값(mean)으로 집계한 값이 들어간 것을 확인할 수 있다.
pdf1 = pd.pivot_table(df, 
                      index='class',
                      columns='sex',
                      values='age',
                      aggfunc='mean')
pdf1

sex        female       male
class
First   34.611765  41.281386
Second  28.722973  30.740707
Third   21.750000  26.507589

In [4]:
# 이번에는 구조를 바꾸고 집계함수를 넣어본다.
pdf2 = pd.pivot_table(df,                       # 피벗할 df
                      index='class',            # 행 위치에 들어갈 열
                      columns='sex',            # 열 위치에 들어갈 열
                      values='survived',        # 데이터로 사용할 열
                      aggfunc=['mean', 'sum'])  # 데이터 집계함수
pdf2
# 3등석에 탄 여자들의 생존여부는 평균 50%정도이다.
# 1등석에 탄 남자들의 생존자는 모두 45명이다.

            mean              sum
sex       female      male female male
class
First   0.968085  0.368852     91   45
Second  0.921053  0.157407     70   17
Third   0.500000  0.135447     72   47

In [5]:
pdf3 = pd.pivot_table(df,
                      index=['class', 'sex'],
                      columns='survived',
                      values=['age', 'fare'],
                      aggfunc=['mean', 'max'])
pdf3

                    mean                                      max        \
                     age                   fare               age
survived               0          1           0           1     0     1
class  sex
First  female  25.666667  34.939024  110.604167  105.978159  50.0  63.0
       male    44.581967  36.248000   62.894910   74.637320  71.0  80.0
Second female  36.000000  28.080882   18.250000   22.288989  57.0  55.0
       male    33.369048  16.022000   19.488965   21.095100  70.0  62.0
Third  female  23.818182  19.329787   19.773093   12.464526  48.0  63.0
       male    27.255814  22.274211   12.204469   15.579696  74.0  45.0


                 fare
survived            0         1
class  sex
First  female  151.55  512.3292
       male    263.00  512.3292
Second female   26.00   65.0000
       male     73.50   39.0000
Third  female   69.55   31.3875
       male     69.55   56.4958

## 멀티 인덱스
---

In [6]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')[['age', 'sex', 'class', 'fare', 'survived']]
grouped = df.groupby(['class', 'sex'])
gdf = grouped.mean()
gdf

                     age        fare  survived
class  sex
First  female  34.611765  106.125798  0.968085
       male    41.281386   67.226127  0.368852
Second female  28.722973   21.970121  0.921053
       male    30.740707   19.741782  0.157407
Third  female  21.750000   16.118810  0.500000
       male    26.507589   12.661633  0.135447

### 멀티 인덱스의 인덱싱
---
- 멀티 인덱스도 데이터프레임을 인덱싱하는 방법과 동일하다.

In [7]:
gdf.loc['First']

              age        fare  survived
sex
female  34.611765  106.125798  0.968085
male    41.281386   67.226127  0.368852

In [8]:
gdf.loc[('First', 'female')]

age          34.611765
fare        106.125798
survived      0.968085
Name: (First, female), dtype: float64